<section class="widget-events">

    <div class="widget-rounded widget-shadow-light bg-white pb-4">

        <div class="p-4 pb-3 d-flex justify-content-between align-items-end">
            
            <div class="d-flex align-items-center" style="fill:var(--bs-nmui-green)">
                <svg class="inherit" width="8" height="8" viewBox="0 0 8 8" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <circle cx="4" cy="4" r="4" fill="#0D98FC"/>
                </svg>
                <h4 class="m-0 py-0 ps-3">Последние события</h4>
            </div>

            <a href="" class="color-nmui-blue text-decoration-none">
                все события
            </a>

        </div>

        <div class="border-top border-nmui-body-bg"></div>


        <div class="d-flex align-items-start px-4 py-3">
            <div class="flex-grow-1">
                <h5>
                    Результаты анализов готовы
                </h5>
                <div class="opacity-75 text-nmui-grey-dark">
                    Общий анализ крови<br>
                    Сегодня, 14:23
                </div>
            </div>
            <div class="position-relative m-0 p-0">
                <div class="bg-nmui-indigo position-absolute top-0 left-0 w-100 h-100 opacity-15 rounded-pill"></div>
                <div class="position-relative p-2" style="fill:var(--bs-nmui-indigo)">
                    <svg class="inherit" width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M19 8H9V9H10V28C10 30.206 11.794 32 14 32C16.206 32 18 30.206 18 28V9H19V8ZM14 31C12.346 31 11 29.654 11 28V18H17V28C17 29.654 15.654 31 14 31ZM17 17H11V9H17V17Z" fill="black"/>
                        <path d="M31 8H21V9H22V28C22 30.206 23.794 32 26 32C28.206 32 30 30.206 30 28V9H31V8ZM29 28C29 29.654 27.654 31 26 31C24.346 31 23 29.654 23 28V18H29V28ZM29 17H23V9H29V17Z" fill="black"/>
                    </svg>
                </div>
            </div>
        </div>

        <div class="d-flex align-items-start px-4 py-3">
            <div class="flex-grow-1">
                <h5>
                    Прием у терапевта
                </h5>
                <div class="opacity-75 text-nmui-grey-dark">
                    Лысенко Татьяна Леонидовна<br>
                    Вчера, 11:44
                </div>
            </div>
            <div class="position-relative m-0 p-0">
                <div class="bg-nmui-blue position-absolute top-0 left-0 w-100 h-100 opacity-15 rounded-pill"></div>
                <div class="position-relative p-2" style="fill:var(--bs-nmui-blue)">
                    <svg class="inherit" width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M16.4831 7.071C16.6782 7.1754 16.8 7.3787 16.8 7.6V9.4C16.8 9.7314 16.5314 10 16.2 10C15.8686 10 15.6 9.7314 15.6 9.4V8.72108L14.5359 9.4305C13.7013 9.9869 13.2 10.9236 13.2 11.9267V16C13.2 18.3196 15.0804 20.2 17.4 20.2H22.2C24.5196 20.2 26.4 18.3196 26.4 16V11.9267C26.4 10.9236 25.8987 9.9869 25.0641 9.4305L24 8.72108V9.4C24 9.7314 23.7314 10 23.4 10C23.0686 10 22.8 9.7314 22.8 9.4V7.6C22.8 7.3787 22.9218 7.1754 23.1169 7.071C23.312 6.9666 23.5487 6.978 23.7328 7.1008L25.7297 8.4321C26.8982 9.211 27.6 10.5224 27.6 11.9267V16C27.6 18.9823 25.1823 21.4 22.2 21.4H20.4V28C20.4 28.5235 20.535 29.3088 20.9145 29.9413C21.2752 30.5425 21.8455 31 22.8 31C23.4718 31 23.9158 30.8657 24.2174 30.6781C24.5135 30.4938 24.7219 30.2274 24.8712 29.8692C25.1588 29.1788 25.1951 28.2463 25.1994 27.1601C24.1647 26.8936 23.4 25.9546 23.4 24.8364C23.4 23.5111 24.4743 22.4358 25.8 22.4358C27.1255 22.4358 28.2 23.5103 28.2 24.8358C28.2 25.9542 27.4351 26.8939 26.3998 27.1602C26.3974 28.2294 26.3659 29.4019 25.9788 30.3308C25.7531 30.8726 25.399 31.3562 24.8514 31.6969C24.3092 32.0343 23.6282 32.2 22.8 32.2C21.3545 32.2 20.4248 31.4575 19.8855 30.5587C19.365 29.6912 19.2 28.6765 19.2 28V21.4H17.4C14.4177 21.4 12 18.9823 12 16V11.9267C12 10.5224 12.7018 9.211 13.8703 8.4321L15.8672 7.1008C16.0513 6.978 16.288 6.9666 16.4831 7.071ZM25.8 26.0358C26.4627 26.0358 27 25.4986 27 24.8358C27 24.1731 26.4627 23.6358 25.8 23.6358C25.1375 23.6358 24.6 24.1734 24.6 24.8364C24.6 25.4989 25.137 26.0358 25.8 26.0358Z" fill="black"/>
                    </svg>
                </div>
            </div>
        </div>

        <div class="d-flex align-items-start px-4 py-3">
            <div class="flex-grow-1">
                <h5>
                    Сообщение в чате
                </h5>
                <div class="opacity-75 text-nmui-grey-dark">
                    Тихомиров Сергей Анатольевич<br>
                    10 марта, 09:22
                </div>
            </div>
            <div class="position-relative m-0 p-0">
                <div class="bg-nmui-green position-absolute top-0 left-0 w-100 h-100 opacity-25 rounded-pill"></div>
                <div class="position-relative p-2" style="fill:var(--bs-nmui-blue)">
                    <svg class="inherit" width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M12.0004 11.4004C11.5749 11.4004 11.1675 11.5705 10.8678 11.872C10.5683 12.1733 10.4004 12.5814 10.4004 13.0063V24.071C10.4004 24.4959 10.5683 24.9039 10.8678 25.2053C11.1675 25.5068 11.5749 25.6769 12.0004 25.6769H23.3401C23.6617 25.6769 23.9735 25.7876 24.2232 25.9905L25.3605 26.9149C27.0595 28.296 29.6004 27.0869 29.6004 24.8974V13.0063C29.6004 12.5814 29.4324 12.1733 29.133 11.872C28.8332 11.5705 28.4259 11.4004 28.0004 11.4004H12.0004ZM12.0004 12.6004C11.8955 12.6004 11.7941 12.6423 11.7189 12.7179C11.6434 12.7939 11.6004 12.8976 11.6004 13.0063V24.071C11.6004 24.1797 11.6434 24.2834 11.7189 24.3594C11.7941 24.435 11.8955 24.4769 12.0004 24.4769H23.3401C23.9375 24.4769 24.5165 24.6826 24.98 25.0593L26.1173 25.9837C27.0323 26.7274 28.4004 26.0763 28.4004 24.8974V13.0063C28.4004 12.8976 28.3574 12.7939 28.2819 12.7179C28.2066 12.6423 28.1053 12.6004 28.0004 12.6004H12.0004Z" fill="black"/>
                        <path d="M15.5004 15.4504C15.169 15.4504 14.9004 15.719 14.9004 16.0504C14.9004 16.3818 15.169 16.6504 15.5004 16.6504H24.5004C24.8318 16.6504 25.1004 16.3818 25.1004 16.0504C25.1004 15.719 24.8318 15.4504 24.5004 15.4504H15.5004Z" fill="black"/>
                        <path d="M15.5004 19.5004C15.169 19.5004 14.9004 19.769 14.9004 20.1004C14.9004 20.4318 15.169 20.7004 15.5004 20.7004H20.9004C21.2318 20.7004 21.5004 20.4318 21.5004 20.1004C21.5004 19.769 21.2318 19.5004 20.9004 19.5004H15.5004Z" fill="black"/>
                    </svg>
                </div>
            </div>
        </div>

        <div class="d-flex align-items-start px-4 py-3">
            <div class="flex-grow-1">
                <h5>
                Результаты диагностики готовы
                </h5>
                <div class="opacity-75 text-nmui-grey-dark">
                    Тихомиров Сергей Анатольевич<br>
                    7 марта, 12:11
                </div>
            </div>
            <div class="position-relative m-0 p-0">
                <div class="bg-nmui-margenta position-absolute top-0 left-0 w-100 h-100 opacity-15 rounded-pill"></div>
                <div class="position-relative p-2" style="fill:var(--bs-nmui-margenta)">
                    <svg class="inherit" width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M13.882 23H8.5C8.224 23 8 22.776 8 22.5C8 22.224 8.224 22 8.5 22H13.882C14.073 22 14.244 21.894 14.329 21.724L15.377 19.628C15.586 19.209 16.004 18.964 16.475 18.989C16.943 19.014 17.335 19.301 17.499 19.739L19.438 24.909C19.468 24.99 19.531 25.01 19.578 25.012C19.632 25.015 19.69 25.002 19.728 24.925L20.776 22.829C21.032 22.318 21.546 22 22.118 22H26.5C26.776 22 27 22.224 27 22.5C27 22.776 26.776 23 26.5 23H22.118C21.927 23 21.756 23.106 21.671 23.276L20.623 25.372C20.423 25.771 20.031 26.013 19.59 26.013C19.569 26.013 19.547 26.013 19.526 26.011C19.058 25.986 18.666 25.699 18.502 25.261L16.563 20.091C16.533 20.01 16.47 19.99 16.423 19.988C16.374 19.993 16.311 19.999 16.273 20.075L15.225 22.171C14.969 22.682 14.454 23 13.882 23ZM30 17.985V27.5C30 29.981 27.981 32 25.5 32H14.5C12.019 32 10 29.981 10 27.5V25.5C10 25.224 10.224 25 10.5 25C10.776 25 11 25.224 11 25.5V27.5C11 29.43 12.57 31 14.5 31H25.5C27.43 31 29 29.43 29 27.5V17.985C29 17.65 28.962 17.322 28.904 17H23.5C22.122 17 21 15.878 21 14.5V9.096C20.677 9.038 20.349 9 20.015 9H14.5C12.57 9 11 10.57 11 12.5V19.5C11 19.776 10.776 20 10.5 20C10.224 20 10 19.776 10 19.5V12.5C10 10.019 12.019 8 14.5 8H20.015C21.751 8 23.384 8.676 24.611 9.904L28.096 13.389C29.324 14.617 30 16.249 30 17.985ZM28.621 16C28.348 15.296 27.939 14.646 27.39 14.096L23.905 10.611C23.355 10.061 22.705 9.652 22.001 9.38V14.501C22.001 15.328 22.674 16.001 23.501 16.001H28.622L28.621 16Z" fill="black"/>
                    </svg>
                </div>
            </div>
        </div>
        
    </div>

</section>